ftp/tech/nix.org
* useful path
  - ~/.nix-profile/etc/profile.d/nix.sh
  - ~/.nix-profile/Applications/
  - /nix

* nix-env

#+BEGIN_SRC
nix-env -qa
nix-env -qaP | grep python3-3
nix-env -qaP '.*emacs.*'

nix-env -f "<nixpkgs>" -qaA haskellPackages

nix-env -i aspell
nix-env -iA nixpkgs.python3

// update
nix-env -uA nixpkgs.python3

// uninstall
nix-env -e python3-3.3.3

// gc
nix-collect-garbage
#+END_SRC

#+BEGIN_SRC sh
nix-env --switch-generation 43
nix-env --list-generations
nix-env --switch-profile /nix/var/nix/profiles/default
#+END_SRC

* NixOS
  - ~/etc/nixos/configuration.nix~
* Questions
  - cant logic after nixos rebuild. what's password? or shall specify
    password in the config file?
  - ~nix-env --switch-generations 34~ how can I know what binary and
    lib available in particular generation?
    + use ~nix-env~ to query or list installed packages
  - more about ~mkDerivation~ (many parameters) ? or study nix
    expressions?
    + 15.4. Derivations of nix manual
