ftp/tech/nix.html
<!DOCTYPE html>
<html>
<head>
<title>nix</title>
<!-- 2017-07-15 Sat 23:55 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Haisheng Wu">
</head>
<body>
<div id="content">
<h1 class="title">nix</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. useful path</a></li>
<li><a href="#sec-2">2. nix-env</a></li>
<li><a href="#sec-3">3. NixOS</a></li>
<li><a href="#sec-4">4. Questions</a></li>
</ul>
</div>
</nav>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> useful path</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>~/.nix-profile/etc/profile.d/nix.sh
</li>
<li>~/.nix-profile/Applications/
</li>
<li>/nix
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> nix-env</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
nix-env -qa
nix-env -qaP | grep python3-3
nix-env -qaP '.*emacs.*'

nix-env -f "&lt;nixpkgs&gt;" -qaA haskellPackages

nix-env -i aspell
nix-env -iA nixpkgs.python3

// update
nix-env -uA nixpkgs.python3

// uninstall
nix-env -e python3-3.3.3

// gc
nix-collect-garbage
</pre>

<div class="org-src-container">

<pre class="src src-sh">nix-env --switch-generation 43
nix-env --list-generations
nix-env --switch-profile /nix/var/nix/profiles/default
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> NixOS</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>/etc/nixos/configuration.nix</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Questions</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>cant logic after nixos rebuild. what's password? or shall specify
password in the config file?
</li>
<li><code>nix-env --switch-generations 34</code> how can I know what binary and
lib available in particular generation?
<ul class="org-ul">
<li>use <code>nix-env</code> to query or list installed packages
</li>
</ul>
</li>
<li>more about <code>mkDerivation</code> (many parameters) ? or study nix
expressions?
<ul class="org-ul">
<li>15.4. Derivations of nix manual
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
